Revit 2026 API

# AdvancedLayeredLayeredFraction Property

---

The property labeled "Fraction" from the "AdvancedLayered" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string LayeredFraction { get; }
```
```vb
Public Shared ReadOnly Property LayeredFraction As String
	Get
```
```cpp
public:
static property String^ LayeredFraction {
	String^ get ();
}
```
```fsharp
static member LayeredFraction : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

AdvancedLayered Class

Autodesk.Revit.DB.Visual Namespace